"""配置文件"""
URL = "http://39.106.82.121/query/getStudentScore"  # 请求地址
DELAY = 0.01  # 每次请求间隔时间，单位秒
TIMEOUT = 10

WEEK_NUM = 20  # 学期的周数，默认为20

# 寝室楼栋，默认如下
# BUILDINGS = ["1N", "1S", "2N", "2S", "3N", "3S", "4N", "4S", "5N",
#              "5S", "6N", "6S", "7#", "8#", "9N", "9S", "10N", "10S"]

BUILDINGS = ["1N", "1S", "2N", "2S", "3N", "3S", "4N", "4S", "5N",
             "5S", "6N", "6S", "7#", "8#", "9N", "9S", "10N", "10S"]
FACULTIES = ["生态", "文法", "英语", "城市", "电气", "计算",
             "经济", "能源", "食品", "物流", "材料", "机械"]
GRADES = ["21", "22", "23", "24"]
